network-tests/v2/oha-results/s3-bucket/linkerd-service-mesh-poc-pod-baseline-warm-up-2-tests/test-pod-baseline-warm-up-2-172.20.208.230-32.txt
Started at 2024-03-29-10-28
Summary:
  Success rate:	100.00%
  Total:	80.2073 secs
  Slowest:	0.1447 secs
  Fastest:	0.0004 secs
  Average:	0.0085 secs
  Requests/sec:	3740.3090

  Total data:	22.89 MiB
  Size/request:	80
  Size/sec:	292.21 KiB

Response time histogram:
  0.000 [1]      |
  0.015 [261019] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [31495]  |■■■
  0.044 [6425]   |
  0.058 [788]    |
  0.073 [152]    |
  0.087 [58]     |
  0.101 [45]     |
  0.116 [14]     |
  0.130 [2]      |
  0.145 [1]      |

Response time distribution:
  10.00% in 0.0033 secs
  25.00% in 0.0046 secs
  50.00% in 0.0061 secs
  75.00% in 0.0095 secs
  90.00% in 0.0178 secs
  95.00% in 0.0242 secs
  99.00% in 0.0356 secs
  99.90% in 0.0572 secs
  99.99% in 0.0947 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0017 secs, 0.0001 secs, 0.0718 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0198 secs

Status code distribution:
  [200] 300000 responses
Finished at 2024-03-29-10-29